cases/channel_mag/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value		uniform 300;
    }
    outlet
    {
    	type	zeroGradient;
    }
    topWall
    {
        type            fixedValue;
        value		uniform 350;
    }
    bottomWall
    {
        type            fixedValue;
        value		uniform 350;
    }
    frontAndBack
    {
        type            empty;
    }
}
// ************************************************************************* //
