cases/channel_mag/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (0 0 0)
    (10 0 0)
    (10 0.5 0)
    (0 0.5 0)
    (0 0 0.1)
    (10 0 0.1)
    (10 0.5 0.1)
    (0 0.5 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (360 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
     	type wall;
     	faces
     	(
     	    (0 4 7 3) // inlet
        );
    }    
    outlet
    {
     	type wall;
     	faces
     	(
           (2 6 5 1) // outlet
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (1 5 4 0) // bottomwall
        );
    }
   frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
